RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7xx_HAL/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h7a3xx.s
        PUBWEAK SWPMI1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SWPMI1_IRQHandler
        B SWPMI1_IRQHandler

        PUBWEAK TIM15_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM15_IRQHandler
        B TIM15_IRQHandler

        PUBWEAK TIM16_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM16_IRQHandler
        B TIM16_IRQHandler

        PUBWEAK TIM17_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM17_IRQHandler
        B TIM17_IRQHandler

        PUBWEAK MDIOS_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
MDIOS_WKUP_IRQHandler
        B MDIOS_WKUP_IRQHandler

        PUBWEAK MDIOS_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
MDIOS_IRQHandler
        B MDIOS_IRQHandler

        PUBWEAK JPEG_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
JPEG_IRQHandler
        B JPEG_IRQHandler

        PUBWEAK MDMA_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
MDMA_IRQHandler
        B MDMA_IRQHandler

        PUBWEAK SDMMC2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SDMMC2_IRQHandler
        B SDMMC2_IRQHandler

        PUBWEAK HSEM1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HSEM1_IRQHandler
        B HSEM1_IRQHandler

        PUBWEAK DAC2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DAC2_IRQHandler
        B DAC2_IRQHandler

        PUBWEAK DMAMUX2_OVR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMAMUX2_OVR_IRQHandler
        B DMAMUX2_OVR_IRQHandler

        PUBWEAK BDMA2_Channel0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
BDMA2_Channel0_IRQHandler
        B BDMA2_Channel0_IRQHandler

        PUBWEAK BDMA2_Channel1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
BDMA2_Channel1_IRQHandler
        B BDMA2_Channel1_IRQHandler

        PUBWEAK BDMA2_Channel2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
BDMA2_Channel2_IRQHandler
        B BDMA2_Channel2_IRQHandler

        PUBWEAK BDMA2_Channel3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
BDMA2_Channel3_IRQHandler
        B BDMA2_Channel3_IRQHandler

        PUBWEAK BDMA2_Channel4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
BDMA2_Channel4_IRQHandler
        B BDMA2_Channel4_IRQHandler

        PUBWEAK BDMA2_Channel5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
BDMA2_Channel5_IRQHandler
        B BDMA2_Channel5_IRQHandler

        PUBWEAK BDMA2_Channel6_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
BDMA2_Channel6_IRQHandler
        B BDMA2_Channel6_IRQHandler

        PUBWEAK BDMA2_Channel7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
BDMA2_Channel7_IRQHandler
        B BDMA2_Channel7_IRQHandler

        PUBWEAK COMP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
COMP_IRQHandler
        B COMP_IRQHandler

        PUBWEAK LPTIM2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LPTIM2_IRQHandler
        B LPTIM2_IRQHandler

        PUBWEAK LPTIM3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LPTIM3_IRQHandler
        B LPTIM3_IRQHandler

        PUBWEAK UART9_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
UART9_IRQHandler
        B UART9_IRQHandler

        PUBWEAK USART10_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USART10_IRQHandler
        B USART10_IRQHandler

        PUBWEAK LPUART1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LPUART1_IRQHandler
        B LPUART1_IRQHandler

        PUBWEAK CRS_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CRS_IRQHandler
        B CRS_IRQHandler

        PUBWEAK ECC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ECC_IRQHandler
        B ECC_IRQHandler

        PUBWEAK DTS_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTS_IRQHandler
        B DTS_IRQHandler

        PUBWEAK WAKEUP_PIN_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
WAKEUP_PIN_IRQHandler
        B WAKEUP_PIN_IRQHandler

        PUBWEAK OCTOSPI2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
OCTOSPI2_IRQHandler
        B OCTOSPI2_IRQHandler

        PUBWEAK GFXMMU_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
GFXMMU_IRQHandler
        B GFXMMU_IRQHandler

        PUBWEAK BDMA1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
BDMA1_IRQHandler
        B BDMA1_IRQHandler
        END
